; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-25)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl2)
	(at plane2 city1)
	(fuel-level plane2 fl3)
	(at plane3 city14)
	(fuel-level plane3 fl5)
	(at plane4 city17)
	(fuel-level plane4 fl6)
	(at plane5 city13)
	(fuel-level plane5 fl6)
	(at person1 city9)
	(at person2 city9)
	(at person3 city15)
	(at person4 city13)
	(at person5 city2)
	(at person6 city13)
	(at person7 city6)
	(at person8 city3)
	(at person9 city3)
	(at person10 city9)
	(at person11 city4)
	(at person12 city8)
	(at person13 city16)
	(at person14 city1)
	(at person15 city5)
	(at person16 city6)
	(at person17 city10)
	(at person18 city9)
	(at person19 city3)
	(at person20 city12)
	(at person21 city13)
	(at person22 city2)
	(at person23 city1)
	(at person24 city13)
	(at person25 city10)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city7)
	(at plane5 city15)
	(at person1 city8)
	(at person2 city8)
	(at person3 city14)
	(at person4 city3)
	(at person5 city10)
	(at person6 city12)
	(at person7 city12)
	(at person8 city17)
	(at person9 city7)
	(at person11 city11)
	(at person12 city2)
	(at person13 city17)
	(at person14 city12)
	(at person15 city15)
	(at person17 city16)
	(at person18 city0)
	(at person19 city4)
	(at person20 city13)
	(at person21 city18)
	(at person22 city7)
	(at person23 city5)
	(at person24 city7)
	(at person25 city13)
	))

)

; plan
1. (board person6 plane5 city13)
   deleted: (at person6 city13)
   added: (in person6 plane5)
   goals met: 0 of 25
2. (board person4 plane5 city13)
   deleted: (at person4 city13)
   added: (in person4 plane5)
   goals met: 0 of 25
3. (zoom plane5 city13 city3 fl6 fl5 fl4)
   deleted: (at plane5 city13) (fuel-level plane5 fl6)
   added: (at plane5 city3) (fuel-level plane5 fl4)
   goals met: 0 of 25
4. (board person9 plane5 city3)
   deleted: (at person9 city3)
   added: (in person9 plane5)
   goals met: 0 of 25
5. (board person8 plane5 city3)
   deleted: (at person8 city3)
   added: (in person8 plane5)
   goals met: 0 of 25
6. (zoom plane5 city3 city9 fl4 fl3 fl2)
   deleted: (at plane5 city3) (fuel-level plane5 fl4)
   added: (at plane5 city9) (fuel-level plane5 fl2)
   goals met: 0 of 25
7. (board person2 plane5 city9)
   deleted: (at person2 city9)
   added: (in person2 plane5)
   goals met: 0 of 25
8. (board person18 plane5 city9)
   deleted: (at person18 city9)
   added: (in person18 plane5)
   goals met: 0 of 25
9. (board person1 plane5 city9)
   deleted: (at person1 city9)
   added: (in person1 plane5)
   goals met: 0 of 25
10. (zoom plane3 city14 city7 fl5 fl4 fl3)
   deleted: (at plane3 city14) (fuel-level plane3 fl5)
   added: (at plane3 city7) (fuel-level plane3 fl3)
   goals met: 1 of 25
11. (board person23 plane2 city1)
   deleted: (at person23 city1)
   added: (in person23 plane2)
   goals met: 1 of 25
12. (zoom plane2 city1 city5 fl3 fl2 fl1)
   deleted: (at plane2 city1) (fuel-level plane2 fl3)
   added: (at plane2 city5) (fuel-level plane2 fl1)
   goals met: 1 of 25
13. (debark person23 plane2 city5)
   deleted: (in person23 plane2)
   added: (at person23 city5)
   goals met: 2 of 25
14. (board person15 plane2 city5)
   deleted: (at person15 city5)
   added: (in person15 plane2)
   goals met: 2 of 25
15. (fly plane2 city5 city15 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 2 of 25
16. (board person3 plane2 city15)
   deleted: (at person3 city15)
   added: (in person3 plane2)
   goals met: 2 of 25
17. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 25
18. (debark person15 plane2 city15)
   deleted: (in person15 plane2)
   added: (at person15 city15)
   goals met: 3 of 25
19. (fly plane2 city15 city14 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 3 of 25
20. (debark person3 plane2 city14)
   deleted: (in person3 plane2)
   added: (at person3 city14)
   goals met: 4 of 25
21. (board person11 plane1 city4)
   deleted: (at person11 city4)
   added: (in person11 plane1)
   goals met: 4 of 25
22. (zoom plane1 city4 city11 fl2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl2)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 4 of 25
23. (debark person11 plane1 city11)
   deleted: (in person11 plane1)
   added: (at person11 city11)
   goals met: 5 of 25
24. (zoom plane5 city9 city8 fl2 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl2)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 5 of 25
25. (refuel plane5 city8 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 5 of 25
26. (debark person2 plane5 city8)
   deleted: (in person2 plane5)
   added: (at person2 city8)
   goals met: 6 of 25
27. (board person12 plane5 city8)
   deleted: (at person12 city8)
   added: (in person12 plane5)
   goals met: 6 of 25
28. (debark person1 plane5 city8)
   deleted: (in person1 plane5)
   added: (at person1 city8)
   goals met: 7 of 25
29. (fly plane5 city8 city0 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 7 of 25
30. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 7 of 25
31. (debark person18 plane5 city0)
   deleted: (in person18 plane5)
   added: (at person18 city0)
   goals met: 8 of 25
32. (fly plane5 city0 city12 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city12) (fuel-level plane5 fl0)
   goals met: 8 of 25
33. (refuel plane5 city12 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 8 of 25
34. (debark person6 plane5 city12)
   deleted: (in person6 plane5)
   added: (at person6 city12)
   goals met: 9 of 25
35. (board person20 plane5 city12)
   deleted: (at person20 city12)
   added: (in person20 plane5)
   goals met: 9 of 25
36. (fly plane5 city12 city13 fl1 fl0)
   deleted: (at plane5 city12) (fuel-level plane5 fl1)
   added: (at plane5 city13) (fuel-level plane5 fl0)
   goals met: 9 of 25
37. (refuel plane5 city13 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 25
38. (board person24 plane5 city13)
   deleted: (at person24 city13)
   added: (in person24 plane5)
   goals met: 9 of 25
39. (board person21 plane5 city13)
   deleted: (at person21 city13)
   added: (in person21 plane5)
   goals met: 9 of 25
40. (debark person20 plane5 city13)
   deleted: (in person20 plane5)
   added: (at person20 city13)
   goals met: 10 of 25
41. (fly plane5 city13 city7 fl1 fl0)
   deleted: (at plane5 city13) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 10 of 25
42. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 25
43. (debark person9 plane5 city7)
   deleted: (in person9 plane5)
   added: (at person9 city7)
   goals met: 11 of 25
44. (debark person24 plane5 city7)
   deleted: (in person24 plane5)
   added: (at person24 city7)
   goals met: 12 of 25
45. (fly plane5 city7 city15 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 13 of 25
46. (refuel plane5 city15 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 25
47. (zoom plane3 city7 city10 fl3 fl2 fl1)
   deleted: (at plane3 city7) (fuel-level plane3 fl3)
   added: (at plane3 city10) (fuel-level plane3 fl1)
   goals met: 12 of 25
48. (board person25 plane3 city10)
   deleted: (at person25 city10)
   added: (in person25 plane3)
   goals met: 12 of 25
49. (board person17 plane3 city10)
   deleted: (at person17 city10)
   added: (in person17 plane3)
   goals met: 12 of 25
50. (fly plane3 city10 city13 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 12 of 25
51. (zoom plane4 city17 city1 fl6 fl5 fl4)
   deleted: (at plane4 city17) (fuel-level plane4 fl6)
   added: (at plane4 city1) (fuel-level plane4 fl4)
   goals met: 12 of 25
52. (zoom plane4 city1 city2 fl4 fl3 fl2)
   deleted: (at plane4 city1) (fuel-level plane4 fl4)
   added: (at plane4 city2) (fuel-level plane4 fl2)
   goals met: 12 of 25
53. (board person5 plane4 city2)
   deleted: (at person5 city2)
   added: (in person5 plane4)
   goals met: 12 of 25
54. (board person22 plane4 city2)
   deleted: (at person22 city2)
   added: (in person22 plane4)
   goals met: 12 of 25
55. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 25
56. (debark person25 plane3 city13)
   deleted: (in person25 plane3)
   added: (at person25 city13)
   goals met: 13 of 25
57. (zoom plane4 city2 city10 fl2 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl2)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 13 of 25
58. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 25
59. (debark person5 plane4 city10)
   deleted: (in person5 plane4)
   added: (at person5 city10)
   goals met: 14 of 25
60. (fly plane4 city10 city7 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 14 of 25
61. (debark person22 plane4 city7)
   deleted: (in person22 plane4)
   added: (at person22 city7)
   goals met: 15 of 25
62. (fly plane3 city13 city16 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 15 of 25
63. (refuel plane3 city16 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 15 of 25
64. (debark person17 plane3 city16)
   deleted: (in person17 plane3)
   added: (at person17 city16)
   goals met: 16 of 25
65. (board person13 plane3 city16)
   deleted: (at person13 city16)
   added: (in person13 plane3)
   goals met: 16 of 25
66. (fly plane3 city16 city17 fl1 fl0)
   deleted: (at plane3 city16) (fuel-level plane3 fl1)
   added: (at plane3 city17) (fuel-level plane3 fl0)
   goals met: 16 of 25
67. (refuel plane3 city17 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 16 of 25
68. (debark person13 plane3 city17)
   deleted: (in person13 plane3)
   added: (at person13 city17)
   goals met: 17 of 25
69. (fly plane3 city17 city1 fl1 fl0)
   deleted: (at plane3 city17) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 17 of 25
70. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 17 of 25
71. (board person14 plane3 city1)
   deleted: (at person14 city1)
   added: (in person14 plane3)
   goals met: 17 of 25
72. (fly plane3 city1 city12 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 17 of 25
73. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 17 of 25
74. (debark person14 plane3 city12)
   deleted: (in person14 plane3)
   added: (at person14 city12)
   goals met: 18 of 25
75. (fly plane3 city12 city3 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 18 of 25
76. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 18 of 25
77. (board person19 plane3 city3)
   deleted: (at person19 city3)
   added: (in person19 plane3)
   goals met: 18 of 25
78. (fly plane3 city3 city4 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 18 of 25
79. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 18 of 25
80. (debark person19 plane3 city4)
   deleted: (in person19 plane3)
   added: (at person19 city4)
   goals met: 19 of 25
81. (fly plane3 city4 city6 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 19 of 25
82. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 19 of 25
83. (board person7 plane3 city6)
   deleted: (at person7 city6)
   added: (in person7 plane3)
   goals met: 19 of 25
84. (fly plane3 city6 city12 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 19 of 25
85. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 19 of 25
86. (debark person7 plane3 city12)
   deleted: (in person7 plane3)
   added: (at person7 city12)
   goals met: 20 of 25
87. (fly plane3 city12 city7 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 21 of 25
88. (fly plane5 city15 city17 fl1 fl0)
   deleted: (at plane5 city15) (fuel-level plane5 fl1)
   added: (at plane5 city17) (fuel-level plane5 fl0)
   goals met: 20 of 25
89. (refuel plane5 city17 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 25
90. (debark person8 plane5 city17)
   deleted: (in person8 plane5)
   added: (at person8 city17)
   goals met: 21 of 25
91. (fly plane5 city17 city18 fl1 fl0)
   deleted: (at plane5 city17) (fuel-level plane5 fl1)
   added: (at plane5 city18) (fuel-level plane5 fl0)
   goals met: 21 of 25
92. (refuel plane5 city18 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 21 of 25
93. (debark person21 plane5 city18)
   deleted: (in person21 plane5)
   added: (at person21 city18)
   goals met: 22 of 25
94. (fly plane5 city18 city2 fl1 fl0)
   deleted: (at plane5 city18) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 22 of 25
95. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 22 of 25
96. (debark person12 plane5 city2)
   deleted: (in person12 plane5)
   added: (at person12 city2)
   goals met: 23 of 25
97. (fly plane5 city2 city3 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 23 of 25
98. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 23 of 25
99. (debark person4 plane5 city3)
   deleted: (in person4 plane5)
   added: (at person4 city3)
   goals met: 24 of 25
100. (fly plane5 city3 city15 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 25 of 25
